Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.131/PIC32CK-GC01/atdf/PIC32CK1025GC01064.atdf
        <register name="RXF1A" offset="0xB8" rw="RW" size="4" initval="0x00000000" caption="Rx FIFO 1 Acknowledge">
          <bitfield name="F1AI" caption="Rx FIFO 1 Acknowledge Index" mask="0x3F"/>
        </register>
        <register name="RXESC" offset="0xBC" rw="RW" size="4" initval="0x00000000" caption="Rx Buffer / FIFO Element Size Configuration">
          <bitfield name="F0DS" caption="Rx FIFO 0 Data Field Size" mask="0x7" values="RXESC__F0DS"/>
          <bitfield name="F1DS" caption="Rx FIFO 1 Data Field Size" mask="0x70" values="RXESC__F1DS"/>
          <bitfield name="RBDS" caption="Rx Buffer Data Field Size" mask="0x700" values="RXESC__RBDS"/>
        </register>
        <register name="TXBC" offset="0xC0" rw="RW" size="4" initval="0x00000000" caption="Tx Buffer Configuration">
          <bitfield name="TBSA" caption="Tx Buffers Start Address" mask="0xFFFF"/>
          <bitfield name="NDTB" caption="Number of Dedicated Transmit Buffers" mask="0x3F0000"/>
          <bitfield name="TFQS" caption="Transmit FIFO/Queue Size" mask="0x3F000000"/>
          <bitfield name="TFQM" caption="Tx FIFO/Queue Mode" mask="0x40000000"/>
        </register>
        <register name="TXFQS" offset="0xC4" rw="R" size="4" initval="0x00000000" caption="Tx FIFO / Queue Status">
          <bitfield name="TFFL" caption="Tx FIFO Free Level" mask="0x3F"/>
          <bitfield name="TFGI" caption="Tx FIFO Get Index" mask="0x1F00"/>
          <bitfield name="TFQPI" caption="Tx FIFO/Queue Put Index" mask="0x1F0000"/>
          <bitfield name="TFQF" caption="Tx FIFO/Queue Full" mask="0x200000"/>
        </register>
        <register name="TXESC" offset="0xC8" rw="RW" size="4" initval="0x00000000" caption="Tx Buffer Element Size Configuration">
          <bitfield name="TBDS" caption="Tx Buffer Data Field Size" mask="0x7" values="TXESC__TBDS"/>
        </register>
        <register name="TXBRP" offset="0xCC" rw="R" size="4" initval="0x00000000" caption="Tx Buffer Request Pending">
          <bitfield name="TRP0" caption="Transmission Request Pending 0" mask="0x1"/>
          <bitfield name="TRP1" caption="Transmission Request Pending 1" mask="0x2"/>
          <bitfield name="TRP2" caption="Transmission Request Pending 2" mask="0x4"/>
          <bitfield name="TRP3" caption="Transmission Request Pending 3" mask="0x8"/>
          <bitfield name="TRP4" caption="Transmission Request Pending 4" mask="0x10"/>
          <bitfield name="TRP5" caption="Transmission Request Pending 5" mask="0x20"/>
          <bitfield name="TRP6" caption="Transmission Request Pending 6" mask="0x40"/>
          <bitfield name="TRP7" caption="Transmission Request Pending 7" mask="0x80"/>
          <bitfield name="TRP8" caption="Transmission Request Pending 8" mask="0x100"/>
          <bitfield name="TRP9" caption="Transmission Request Pending 9" mask="0x200"/>
          <bitfield name="TRP10" caption="Transmission Request Pending 10" mask="0x400"/>
          <bitfield name="TRP11" caption="Transmission Request Pending 11" mask="0x800"/>
          <bitfield name="TRP12" caption="Transmission Request Pending 12" mask="0x1000"/>
          <bitfield name="TRP13" caption="Transmission Request Pending 13" mask="0x2000"/>
          <bitfield name="TRP14" caption="Transmission Request Pending 14" mask="0x4000"/>
          <bitfield name="TRP15" caption="Transmission Request Pending 15" mask="0x8000"/>
          <bitfield name="TRP16" caption="Transmission Request Pending 16" mask="0x10000"/>
          <bitfield name="TRP17" caption="Transmission Request Pending 17" mask="0x20000"/>
          <bitfield name="TRP18" caption="Transmission Request Pending 18" mask="0x40000"/>
          <bitfield name="TRP19" caption="Transmission Request Pending 19" mask="0x80000"/>
          <bitfield name="TRP20" caption="Transmission Request Pending 20" mask="0x100000"/>
          <bitfield name="TRP21" caption="Transmission Request Pending 21" mask="0x200000"/>
          <bitfield name="TRP22" caption="Transmission Request Pending 22" mask="0x400000"/>
          <bitfield name="TRP23" caption="Transmission Request Pending 23" mask="0x800000"/>
          <bitfield name="TRP24" caption="Transmission Request Pending 24" mask="0x1000000"/>
          <bitfield name="TRP25" caption="Transmission Request Pending 25" mask="0x2000000"/>
          <bitfield name="TRP26" caption="Transmission Request Pending 26" mask="0x4000000"/>
          <bitfield name="TRP27" caption="Transmission Request Pending 27" mask="0x8000000"/>
          <bitfield name="TRP28" caption="Transmission Request Pending 28" mask="0x10000000"/>
          <bitfield name="TRP29" caption="Transmission Request Pending 29" mask="0x20000000"/>
          <bitfield name="TRP30" caption="Transmission Request Pending 30" mask="0x40000000"/>
          <bitfield name="TRP31" caption="Transmission Request Pending 31" mask="0x80000000"/>
        </register>
        <register name="TXBAR" offset="0xD0" rw="RW" size="4" initval="0x00000000" caption="Tx Buffer Add Request">
          <bitfield name="AR0" caption="Add Request 0" mask="0x1"/>
          <bitfield name="AR1" caption="Add Request 1" mask="0x2"/>
          <bitfield name="AR2" caption="Add Request 2" mask="0x4"/>
          <bitfield name="AR3" caption="Add Request 3" mask="0x8"/>
          <bitfield name="AR4" caption="Add Request 4" mask="0x10"/>
          <bitfield name="AR5" caption="Add Request 5" mask="0x20"/>
          <bitfield name="AR6" caption="Add Request 6" mask="0x40"/>
          <bitfield name="AR7" caption="Add Request 7" mask="0x80"/>
          <bitfield name="AR8" caption="Add Request 8" mask="0x100"/>
          <bitfield name="AR9" caption="Add Request 9" mask="0x200"/>
          <bitfield name="AR10" caption="Add Request 10" mask="0x400"/>
          <bitfield name="AR11" caption="Add Request 11" mask="0x800"/>
          <bitfield name="AR12" caption="Add Request 12" mask="0x1000"/>
          <bitfield name="AR13" caption="Add Request 13" mask="0x2000"/>
          <bitfield name="AR14" caption="Add Request 14" mask="0x4000"/>
          <bitfield name="AR15" caption="Add Request 15" mask="0x8000"/>
          <bitfield name="AR16" caption="Add Request 16" mask="0x10000"/>
          <bitfield name="AR17" caption="Add Request 17" mask="0x20000"/>
          <bitfield name="AR18" caption="Add Request 18" mask="0x40000"/>
          <bitfield name="AR19" caption="Add Request 19" mask="0x80000"/>
          <bitfield name="AR20" caption="Add Request 20" mask="0x100000"/>
          <bitfield name="AR21" caption="Add Request 21" mask="0x200000"/>
          <bitfield name="AR22" caption="Add Request 22" mask="0x400000"/>
          <bitfield name="AR23" caption="Add Request 23" mask="0x800000"/>
          <bitfield name="AR24" caption="Add Request 24" mask="0x1000000"/>
          <bitfield name="AR25" caption="Add Request 25" mask="0x2000000"/>
          <bitfield name="AR26" caption="Add Request 26" mask="0x4000000"/>
          <bitfield name="AR27" caption="Add Request 27" mask="0x8000000"/>
          <bitfield name="AR28" caption="Add Request 28" mask="0x10000000"/>
          <bitfield name="AR29" caption="Add Request 29" mask="0x20000000"/>
          <bitfield name="AR30" caption="Add Request 30" mask="0x40000000"/>
          <bitfield name="AR31" caption="Add Request 31" mask="0x80000000"/>
        </register>
